# getting info into one big table

In [266]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', None)

dateparse = lambda x: pd.datetime.strptime(x, '%Y-%m-%d')

## competitors

In [267]:
data_competitors = pd.read_csv("Competitors1.csv", 
                               names=["Id", "Departure", "Arrival", "Airline", "Competitors",
                                      "Codeshare"], skiprows=1)
data_competitors = data_competitors.drop(['Id', "Airline"], axis=1)

In [268]:
data_competitors.head()

  Departure Arrival  Competitors  Codeshare
0       ATL     BOS            3          8
1       ATL     CLT            2          8
2       ATL     DEN            4         11
3       ATL     DFW            5         11
4       ATL     DTW            2          8

## main training data

In [269]:
data_train = pd.read_csv("../public_train.csv", parse_dates=['DateOfDeparture'], date_parser=dateparse)

In [270]:
data_ = pd.merge(data_train, data_competitors, 
                 how='left', left_on=['Departure', 'Arrival'], right_on=['Departure','Arrival'])

In [271]:
data_.head()

,DateOfDeparture,Departure,Arrival,WeeksToDeparture,log_PAX,std_wtd,Competitors,Codeshare
0,2012-10-21,DFW,SFO,14.600000,10.757779,11.575837,4,5
1,2012-09-13,LAX,ATL,14.730769,11.808097,13.364304,3,9
2,2012-09-04,ORD,IAH,8.470588,10.865349,5.885551,3,4
3,2012-08-13,DEN,PHX,8.200000,10.710562,6.292853,6,7
4,2012-09-10,ORD,SEA,12.090909,11.498355,9.138662,4,4

## national holidays

In [272]:
# Date, National Holiday, Special Day
data_holidays = pd.read_csv("national_holidays.csv", parse_dates=['Date'], date_parser=dateparse)
data_holidays = data_holidays.drop(['National Holiday', 'Special Day'], axis=1)
data_holidays = data_holidays.rename(columns={'Date': 'holiday'}) 
data_holidays.head()

     holiday
0 2011-09-05
1 2011-09-11
2 2011-09-29
3 2011-10-08
4 2011-10-10

In [273]:
data_ = pd.merge(data_, data_holidays, how='left', left_on=['DateOfDeparture'], right_on=['holiday'])

In [274]:
data_.head()

,DateOfDeparture,Departure,Arrival,WeeksToDeparture,log_PAX,std_wtd,Competitors,Codeshare,holiday
0,2012-10-21,DFW,SFO,14.600000,10.757779,11.575837,4,5,NaT
1,2012-09-13,LAX,ATL,14.730769,11.808097,13.364304,3,9,NaT
2,2012-09-04,ORD,IAH,8.470588,10.865349,5.885551,3,4,NaT
3,2012-08-13,DEN,PHX,8.200000,10.710562,6.292853,6,7,NaT
4,2012-09-10,ORD,SEA,12.090909,11.498355,9.138662,4,4,NaT

In [275]:
data_['holiday'] = pd.to_datetime(data_['holiday']).dt.week.fillna(0)
print data_['holiday'].unique()
data_.head()

[  0.  45.  52.  37.   8.  47.  22.  39.  44.   7.  36.   1.  40.  38.  41.
  51.   4.  14.  27.   3.  19.  11.  24.]

,DateOfDeparture,Departure,Arrival,WeeksToDeparture,log_PAX,std_wtd,Competitors,Codeshare,holiday
0,2012-10-21,DFW,SFO,14.600000,10.757779,11.575837,4,5,0.0
1,2012-09-13,LAX,ATL,14.730769,11.808097,13.364304,3,9,0.0
2,2012-09-04,ORD,IAH,8.470588,10.865349,5.885551,3,4,0.0
3,2012-08-13,DEN,PHX,8.200000,10.710562,6.292853,6,7,0.0
4,2012-09-10,ORD,SEA,12.090909,11.498355,9.138662,4,4,0.0